MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx664f128h.h
extern volatile __U6STAbits_t U6STAbits __asm__ ("U6STA") __attribute__((section("sfrs"), address(0xBF806610)));
extern volatile uint32_t        U2BSTACLR __attribute__((section("sfrs"),address(0xBF806614)));
extern volatile uint32_t        U6STACLR __attribute__((section("sfrs"),address(0xBF806614)));
extern volatile uint32_t        U2BSTASET __attribute__((section("sfrs"),address(0xBF806618)));
extern volatile uint32_t        U6STASET __attribute__((section("sfrs"),address(0xBF806618)));
extern volatile uint32_t        U2BSTAINV __attribute__((section("sfrs"),address(0xBF80661C)));
extern volatile uint32_t        U6STAINV __attribute__((section("sfrs"),address(0xBF80661C)));
#define U2BTXREG U2BTXREG
extern volatile uint32_t   U2BTXREG __attribute__((section("sfrs"), address(0xBF806620)));
#define U6TXREG U6TXREG
extern volatile uint32_t   U6TXREG __attribute__((section("sfrs"), address(0xBF806620)));
#define U2BRXREG U2BRXREG
extern volatile uint32_t   U2BRXREG __attribute__((section("sfrs"), address(0xBF806630)));
#define U6RXREG U6RXREG
extern volatile uint32_t   U6RXREG __attribute__((section("sfrs"), address(0xBF806630)));
#define U2BBRG U2BBRG
extern volatile uint32_t   U2BBRG __attribute__((section("sfrs"), address(0xBF806640)));
#define U6BRG U6BRG
extern volatile uint32_t   U6BRG __attribute__((section("sfrs"), address(0xBF806640)));
extern volatile uint32_t        U2BBRGCLR __attribute__((section("sfrs"),address(0xBF806644)));
extern volatile uint32_t        U6BRGCLR __attribute__((section("sfrs"),address(0xBF806644)));
extern volatile uint32_t        U2BBRGSET __attribute__((section("sfrs"),address(0xBF806648)));
extern volatile uint32_t        U6BRGSET __attribute__((section("sfrs"),address(0xBF806648)));
extern volatile uint32_t        U2BBRGINV __attribute__((section("sfrs"),address(0xBF80664C)));
extern volatile uint32_t        U6BRGINV __attribute__((section("sfrs"),address(0xBF80664C)));
#define U2MODE U2MODE
extern volatile uint32_t   U2MODE __attribute__((section("sfrs"), address(0xBF806800)));
typedef union {
  struct {
    uint32_t STSEL:1;
    uint32_t PDSEL:2;
    uint32_t BRGH:1;
    uint32_t RXINV:1;
    uint32_t ABAUD:1;
    uint32_t LPBACK:1;
    uint32_t WAKE:1;
    uint32_t UEN:2;
    uint32_t :1;
    uint32_t RTSMD:1;
    uint32_t IREN:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :1;
    uint32_t PDSEL0:1;
    uint32_t PDSEL1:1;
    uint32_t :5;
    uint32_t UEN0:1;
    uint32_t UEN1:1;
  };
  struct {
    uint32_t :13;
    uint32_t USIDL:1;
    uint32_t :1;
    uint32_t UARTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __U2MODEbits_t;
extern volatile __U2MODEbits_t U2MODEbits __asm__ ("U2MODE") __attribute__((section("sfrs"), address(0xBF806800)));
#define U3AMODE U3AMODE
extern volatile uint32_t   U3AMODE __attribute__((section("sfrs"), address(0xBF806800)));
typedef union {
  struct {
    uint32_t STSEL:1;
    uint32_t PDSEL:2;
    uint32_t BRGH:1;
    uint32_t RXINV:1;
    uint32_t ABAUD:1;
    uint32_t LPBACK:1;
    uint32_t WAKE:1;
    uint32_t UEN:2;
    uint32_t :1;
    uint32_t RTSMD:1;
    uint32_t IREN:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :1;
    uint32_t PDSEL0:1;
    uint32_t PDSEL1:1;
    uint32_t :5;
    uint32_t UEN0:1;
    uint32_t UEN1:1;
  };
  struct {
    uint32_t :13;
    uint32_t USIDL:1;
    uint32_t :1;
    uint32_t UARTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __U3AMODEbits_t;
extern volatile __U3AMODEbits_t U3AMODEbits __asm__ ("U3AMODE") __attribute__((section("sfrs"), address(0xBF806800)));
extern volatile uint32_t        U2MODECLR __attribute__((section("sfrs"),address(0xBF806804)));
extern volatile uint32_t        U3AMODECLR __attribute__((section("sfrs"),address(0xBF806804)));
extern volatile uint32_t        U2MODESET __attribute__((section("sfrs"),address(0xBF806808)));
extern volatile uint32_t        U3AMODESET __attribute__((section("sfrs"),address(0xBF806808)));
extern volatile uint32_t        U2MODEINV __attribute__((section("sfrs"),address(0xBF80680C)));
extern volatile uint32_t        U3AMODEINV __attribute__((section("sfrs"),address(0xBF80680C)));
#define U2STA U2STA
extern volatile uint32_t   U2STA __attribute__((section("sfrs"), address(0xBF806810)));
typedef union {
  struct {
    uint32_t URXDA:1;
    uint32_t OERR:1;
    uint32_t FERR:1;
    uint32_t PERR:1;
    uint32_t RIDLE:1;
    uint32_t ADDEN:1;
    uint32_t URXISEL:2;
    uint32_t TRMT:1;
    uint32_t UTXBF:1;
    uint32_t UTXEN:1;
    uint32_t UTXBRK:1;
    uint32_t URXEN:1;
    uint32_t UTXINV:1;
    uint32_t UTXISEL:2;
    uint32_t ADDR:8;
    uint32_t ADM_EN:1;
  };
  struct {
    uint32_t :6;
    uint32_t URXISEL0:1;
    uint32_t URXISEL1:1;
    uint32_t :6;
    uint32_t UTXISEL0:1;
    uint32_t UTXISEL1:1;
  };
  struct {
    uint32_t :14;
    uint32_t UTXSEL:2;
  };
  struct {
    uint32_t w:32;
  };
} __U2STAbits_t;
extern volatile __U2STAbits_t U2STAbits __asm__ ("U2STA") __attribute__((section("sfrs"), address(0xBF806810)));
#define U3ASTA U3ASTA
extern volatile uint32_t   U3ASTA __attribute__((section("sfrs"), address(0xBF806810)));
typedef union {
  struct {
    uint32_t URXDA:1;
    uint32_t OERR:1;
    uint32_t FERR:1;
    uint32_t PERR:1;
    uint32_t RIDLE:1;
    uint32_t ADDEN:1;
    uint32_t URXISEL:2;
    uint32_t TRMT:1;
    uint32_t UTXBF:1;
    uint32_t UTXEN:1;
    uint32_t UTXBRK:1;
    uint32_t URXEN:1;
    uint32_t UTXINV:1;
    uint32_t UTXISEL:2;
    uint32_t ADDR:8;
    uint32_t ADM_EN:1;
  };
  struct {
    uint32_t :6;
    uint32_t URXISEL0:1;
    uint32_t URXISEL1:1;
    uint32_t :6;
    uint32_t UTXISEL0:1;
    uint32_t UTXISEL1:1;
  };
  struct {
    uint32_t :14;
    uint32_t UTXSEL:2;
  };
  struct {
    uint32_t w:32;
  };
} __U3ASTAbits_t;
extern volatile __U3ASTAbits_t U3ASTAbits __asm__ ("U3ASTA") __attribute__((section("sfrs"), address(0xBF806810)));
extern volatile uint32_t        U2STACLR __attribute__((section("sfrs"),address(0xBF806814)));
extern volatile uint32_t        U3ASTACLR __attribute__((section("sfrs"),address(0xBF806814)));
extern volatile uint32_t        U2STASET __attribute__((section("sfrs"),address(0xBF806818)));
extern volatile uint32_t        U3ASTASET __attribute__((section("sfrs"),address(0xBF806818)));
extern volatile uint32_t        U2STAINV __attribute__((section("sfrs"),address(0xBF80681C)));
extern volatile uint32_t        U3ASTAINV __attribute__((section("sfrs"),address(0xBF80681C)));
#define U2TXREG U2TXREG
extern volatile uint32_t   U2TXREG __attribute__((section("sfrs"), address(0xBF806820)));
#define U3ATXREG U3ATXREG
extern volatile uint32_t   U3ATXREG __attribute__((section("sfrs"), address(0xBF806820)));
#define U2RXREG U2RXREG
extern volatile uint32_t   U2RXREG __attribute__((section("sfrs"), address(0xBF806830)));
#define U3ARXREG U3ARXREG
extern volatile uint32_t   U3ARXREG __attribute__((section("sfrs"), address(0xBF806830)));
#define U2BRG U2BRG
extern volatile uint32_t   U2BRG __attribute__((section("sfrs"), address(0xBF806840)));
#define U3ABRG U3ABRG
extern volatile uint32_t   U3ABRG __attribute__((section("sfrs"), address(0xBF806840)));
extern volatile uint32_t        U2BRGCLR __attribute__((section("sfrs"),address(0xBF806844)));
extern volatile uint32_t        U3ABRGCLR __attribute__((section("sfrs"),address(0xBF806844)));
extern volatile uint32_t        U2BRGSET __attribute__((section("sfrs"),address(0xBF806848)));
extern volatile uint32_t        U3ABRGSET __attribute__((section("sfrs"),address(0xBF806848)));
extern volatile uint32_t        U2BRGINV __attribute__((section("sfrs"),address(0xBF80684C)));
extern volatile uint32_t        U3ABRGINV __attribute__((section("sfrs"),address(0xBF80684C)));
#define U3BMODE U3BMODE
extern volatile uint32_t   U3BMODE __attribute__((section("sfrs"), address(0xBF806A00)));
typedef union {
  struct {
    uint32_t STSEL:1;
    uint32_t PDSEL:2;
    uint32_t BRGH:1;
    uint32_t RXINV:1;
    uint32_t ABAUD:1;
    uint32_t LPBACK:1;
    uint32_t WAKE:1;
    uint32_t :4;
    uint32_t IREN:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :1;
    uint32_t PDSEL0:1;
    uint32_t PDSEL1:1;
  };
  struct {
    uint32_t :13;
    uint32_t USIDL:1;
    uint32_t :1;
    uint32_t UARTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __U3BMODEbits_t;
extern volatile __U3BMODEbits_t U3BMODEbits __asm__ ("U3BMODE") __attribute__((section("sfrs"), address(0xBF806A00)));
#define U5MODE U5MODE
extern volatile uint32_t   U5MODE __attribute__((section("sfrs"), address(0xBF806A00)));
typedef union {
  struct {
    uint32_t STSEL:1;
    uint32_t PDSEL:2;
    uint32_t BRGH:1;
    uint32_t RXINV:1;
    uint32_t ABAUD:1;
    uint32_t LPBACK:1;
    uint32_t WAKE:1;
    uint32_t :4;
    uint32_t IREN:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :1;
    uint32_t PDSEL0:1;
    uint32_t PDSEL1:1;
  };
  struct {
    uint32_t :13;
    uint32_t USIDL:1;
    uint32_t :1;
    uint32_t UARTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __U5MODEbits_t;
extern volatile __U5MODEbits_t U5MODEbits __asm__ ("U5MODE") __attribute__((section("sfrs"), address(0xBF806A00)));
extern volatile uint32_t        U3BMODECLR __attribute__((section("sfrs"),address(0xBF806A04)));
extern volatile uint32_t        U5MODECLR __attribute__((section("sfrs"),address(0xBF806A04)));
extern volatile uint32_t        U3BMODESET __attribute__((section("sfrs"),address(0xBF806A08)));
extern volatile uint32_t        U5MODESET __attribute__((section("sfrs"),address(0xBF806A08)));
extern volatile uint32_t        U3BMODEINV __attribute__((section("sfrs"),address(0xBF806A0C)));
extern volatile uint32_t        U5MODEINV __attribute__((section("sfrs"),address(0xBF806A0C)));
#define U3BSTA U3BSTA
extern volatile uint32_t   U3BSTA __attribute__((section("sfrs"), address(0xBF806A10)));
typedef union {
  struct {
    uint32_t URXDA:1;
    uint32_t OERR:1;
    uint32_t FERR:1;
    uint32_t PERR:1;
    uint32_t RIDLE:1;
    uint32_t ADDEN:1;
    uint32_t URXISEL:2;
    uint32_t TRMT:1;
    uint32_t UTXBF:1;
    uint32_t UTXEN:1;
    uint32_t UTXBRK:1;
    uint32_t URXEN:1;
    uint32_t UTXINV:1;
    uint32_t UTXISEL:2;
    uint32_t ADDR:8;
    uint32_t ADM_EN:1;
  };
  struct {
    uint32_t :6;
    uint32_t URXISEL0:1;
    uint32_t URXISEL1:1;
    uint32_t :6;
    uint32_t UTXISEL0:1;
    uint32_t UTXISEL1:1;
  };
  struct {
    uint32_t :14;
    uint32_t UTXSEL:2;
  };
  struct {
    uint32_t w:32;
  };
} __U3BSTAbits_t;
extern volatile __U3BSTAbits_t U3BSTAbits __asm__ ("U3BSTA") __attribute__((section("sfrs"), address(0xBF806A10)));
#define U5STA U5STA
extern volatile uint32_t   U5STA __attribute__((section("sfrs"), address(0xBF806A10)));
typedef union {
  struct {
    uint32_t URXDA:1;
    uint32_t OERR:1;
    uint32_t FERR:1;
    uint32_t PERR:1;
    uint32_t RIDLE:1;
    uint32_t ADDEN:1;
    uint32_t URXISEL:2;
    uint32_t TRMT:1;
    uint32_t UTXBF:1;
    uint32_t UTXEN:1;
    uint32_t UTXBRK:1;
    uint32_t URXEN:1;
    uint32_t UTXINV:1;
    uint32_t UTXISEL:2;
    uint32_t ADDR:8;
    uint32_t ADM_EN:1;
  };
  struct {
    uint32_t :6;
    uint32_t URXISEL0:1;
    uint32_t URXISEL1:1;
    uint32_t :6;
    uint32_t UTXISEL0:1;
    uint32_t UTXISEL1:1;
  };
  struct {
    uint32_t :14;
    uint32_t UTXSEL:2;
  };
  struct {
    uint32_t w:32;
  };
} __U5STAbits_t;
extern volatile __U5STAbits_t U5STAbits __asm__ ("U5STA") __attribute__((section("sfrs"), address(0xBF806A10)));
extern volatile uint32_t        U3BSTACLR __attribute__((section("sfrs"),address(0xBF806A14)));
extern volatile uint32_t        U5STACLR __attribute__((section("sfrs"),address(0xBF806A14)));
extern volatile uint32_t        U3BSTASET __attribute__((section("sfrs"),address(0xBF806A18)));
extern volatile uint32_t        U5STASET __attribute__((section("sfrs"),address(0xBF806A18)));
extern volatile uint32_t        U3BSTAINV __attribute__((section("sfrs"),address(0xBF806A1C)));
extern volatile uint32_t        U5STAINV __attribute__((section("sfrs"),address(0xBF806A1C)));
#define U3BTXREG U3BTXREG
extern volatile uint32_t   U3BTXREG __attribute__((section("sfrs"), address(0xBF806A20)));
#define U5TXREG U5TXREG
extern volatile uint32_t   U5TXREG __attribute__((section("sfrs"), address(0xBF806A20)));
#define U3BRXREG U3BRXREG
extern volatile uint32_t   U3BRXREG __attribute__((section("sfrs"), address(0xBF806A30)));
#define U5RXREG U5RXREG
extern volatile uint32_t   U5RXREG __attribute__((section("sfrs"), address(0xBF806A30)));
#define U3BBRG U3BBRG
extern volatile uint32_t   U3BBRG __attribute__((section("sfrs"), address(0xBF806A40)));
#define U5BRG U5BRG
extern volatile uint32_t   U5BRG __attribute__((section("sfrs"), address(0xBF806A40)));
extern volatile uint32_t        U3BBRGCLR __attribute__((section("sfrs"),address(0xBF806A44)));
extern volatile uint32_t        U5BRGCLR __attribute__((section("sfrs"),address(0xBF806A44)));
extern volatile uint32_t        U3BBRGSET __attribute__((section("sfrs"),address(0xBF806A48)));
extern volatile uint32_t        U5BRGSET __attribute__((section("sfrs"),address(0xBF806A48)));
extern volatile uint32_t        U3BBRGINV __attribute__((section("sfrs"),address(0xBF806A4C)));
extern volatile uint32_t        U5BRGINV __attribute__((section("sfrs"),address(0xBF806A4C)));
#define PMCON PMCON
extern volatile uint32_t   PMCON __attribute__((section("sfrs"), address(0xBF807000)));
typedef union {
  struct {
    uint32_t RDSP:1;
    uint32_t WRSP:1;
    uint32_t :1;
    uint32_t CS1P:1;
    uint32_t CS2P:1;
    uint32_t ALP:1;
    uint32_t CSF:2;
    uint32_t PTRDEN:1;
    uint32_t PTWREN:1;
    uint32_t PMPTTL:1;
    uint32_t ADRMUX:2;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t :6;
    uint32_t CSF0:1;
    uint32_t CSF1:1;
    uint32_t :3;
    uint32_t ADRMUX0:1;
    uint32_t ADRMUX1:1;
  };
  struct {
    uint32_t :13;
    uint32_t PSIDL:1;
    uint32_t :1;
    uint32_t PMPEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __PMCONbits_t;
extern volatile __PMCONbits_t PMCONbits __asm__ ("PMCON") __attribute__((section("sfrs"), address(0xBF807000)));
extern volatile uint32_t        PMCONCLR __attribute__((section("sfrs"),address(0xBF807004)));
extern volatile uint32_t        PMCONSET __attribute__((section("sfrs"),address(0xBF807008)));
extern volatile uint32_t        PMCONINV __attribute__((section("sfrs"),address(0xBF80700C)));
#define PMMODE PMMODE
extern volatile uint32_t   PMMODE __attribute__((section("sfrs"), address(0xBF807010)));
typedef union {
  struct {
    uint32_t WAITE:2;
    uint32_t WAITM:4;
    uint32_t WAITB:2;
    uint32_t MODE:2;
    uint32_t MODE16:1;
    uint32_t INCM:2;
    uint32_t IRQM:2;
    uint32_t BUSY:1;
  };
  struct {
    uint32_t WAITE0:1;
    uint32_t WAITE1:1;
    uint32_t WAITM0:1;
    uint32_t WAITM1:1;
    uint32_t WAITM2:1;
    uint32_t WAITM3:1;
    uint32_t WAITB0:1;
    uint32_t WAITB1:1;
    uint32_t MODE0:1;
    uint32_t MODE1:1;
    uint32_t :1;
    uint32_t INCM0:1;
    uint32_t INCM1:1;
    uint32_t IRQM0:1;
    uint32_t IRQM1:1;
  };
  struct {
    uint32_t w:32;
  };
} __PMMODEbits_t;
extern volatile __PMMODEbits_t PMMODEbits __asm__ ("PMMODE") __attribute__((section("sfrs"), address(0xBF807010)));
extern volatile uint32_t        PMMODECLR __attribute__((section("sfrs"),address(0xBF807014)));
extern volatile uint32_t        PMMODESET __attribute__((section("sfrs"),address(0xBF807018)));
extern volatile uint32_t        PMMODEINV __attribute__((section("sfrs"),address(0xBF80701C)));
#define PMADDR PMADDR
extern volatile uint32_t   PMADDR __attribute__((section("sfrs"), address(0xBF807020)));
typedef union {
  struct {
    uint32_t ADDR:14;
    uint32_t CS:2;
  };
  struct {
    uint32_t PADDR:14;
  };
  struct {
    uint32_t :14;
    uint32_t CS1:1;
    uint32_t CS2:1;
  };
  struct {
    uint32_t w:32;
  };
} __PMADDRbits_t;
extern volatile __PMADDRbits_t PMADDRbits __asm__ ("PMADDR") __attribute__((section("sfrs"), address(0xBF807020)));
extern volatile uint32_t        PMADDRCLR __attribute__((section("sfrs"),address(0xBF807024)));
extern volatile uint32_t        PMADDRSET __attribute__((section("sfrs"),address(0xBF807028)));
extern volatile uint32_t        PMADDRINV __attribute__((section("sfrs"),address(0xBF80702C)));
#define PMDOUT PMDOUT
extern volatile uint32_t   PMDOUT __attribute__((section("sfrs"), address(0xBF807030)));
typedef union {
  struct {
    uint32_t DATAOUT:32;
  };
  struct {
    uint32_t w:32;
  };
} __PMDOUTbits_t;
extern volatile __PMDOUTbits_t PMDOUTbits __asm__ ("PMDOUT") __attribute__((section("sfrs"), address(0xBF807030)));
extern volatile uint32_t        PMDOUTCLR __attribute__((section("sfrs"),address(0xBF807034)));
extern volatile uint32_t        PMDOUTSET __attribute__((section("sfrs"),address(0xBF807038)));
extern volatile uint32_t        PMDOUTINV __attribute__((section("sfrs"),address(0xBF80703C)));
#define PMDIN PMDIN
extern volatile uint32_t   PMDIN __attribute__((section("sfrs"), address(0xBF807040)));
typedef union {
  struct {
    uint32_t DATAIN:32;
  };
  struct {
    uint32_t w:32;
  };
} __PMDINbits_t;
extern volatile __PMDINbits_t PMDINbits __asm__ ("PMDIN") __attribute__((section("sfrs"), address(0xBF807040)));
extern volatile uint32_t        PMDINCLR __attribute__((section("sfrs"),address(0xBF807044)));
extern volatile uint32_t        PMDINSET __attribute__((section("sfrs"),address(0xBF807048)));
extern volatile uint32_t        PMDININV __attribute__((section("sfrs"),address(0xBF80704C)));
#define PMAEN PMAEN
extern volatile uint32_t   PMAEN __attribute__((section("sfrs"), address(0xBF807050)));
typedef union {
  struct {
    uint32_t PTEN:16;
  };
  struct {
    uint32_t PTEN0:1;
    uint32_t PTEN1:1;
    uint32_t PTEN2:1;
    uint32_t PTEN3:1;
    uint32_t PTEN4:1;
    uint32_t PTEN5:1;
    uint32_t PTEN6:1;
    uint32_t PTEN7:1;
    uint32_t PTEN8:1;
    uint32_t PTEN9:1;
    uint32_t PTEN10:1;
    uint32_t PTEN11:1;
    uint32_t PTEN12:1;
    uint32_t PTEN13:1;
    uint32_t PTEN14:1;
    uint32_t PTEN15:1;
  };
  struct {
    uint32_t w:32;
  };
} __PMAENbits_t;
extern volatile __PMAENbits_t PMAENbits __asm__ ("PMAEN") __attribute__((section("sfrs"), address(0xBF807050)));
extern volatile uint32_t        PMAENCLR __attribute__((section("sfrs"),address(0xBF807054)));
extern volatile uint32_t        PMAENSET __attribute__((section("sfrs"),address(0xBF807058)));
extern volatile uint32_t        PMAENINV __attribute__((section("sfrs"),address(0xBF80705C)));
#define PMSTAT PMSTAT
extern volatile uint32_t   PMSTAT __attribute__((section("sfrs"), address(0xBF807060)));
typedef union {
  struct {
    uint32_t OB0E:1;
    uint32_t OB1E:1;
    uint32_t OB2E:1;
    uint32_t OB3E:1;
    uint32_t :2;
    uint32_t OBUF:1;
    uint32_t OBE:1;
    uint32_t IB0F:1;
    uint32_t IB1F:1;
    uint32_t IB2F:1;
    uint32_t IB3F:1;
    uint32_t :2;
    uint32_t IBOV:1;
    uint32_t IBF:1;
  };
  struct {
    uint32_t w:32;
  };
} __PMSTATbits_t;
