MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx664f128h.h
extern volatile __PORTEbits_t PORTEbits __asm__ ("PORTE") __attribute__((section("sfrs"), address(0xBF886110)));
extern volatile uint32_t        PORTECLR __attribute__((section("sfrs"),address(0xBF886114)));
extern volatile uint32_t        PORTESET __attribute__((section("sfrs"),address(0xBF886118)));
extern volatile uint32_t        PORTEINV __attribute__((section("sfrs"),address(0xBF88611C)));
#define LATE LATE
extern volatile uint32_t   LATE __attribute__((section("sfrs"), address(0xBF886120)));
typedef union {
  struct {
    uint32_t LATE0:1;
    uint32_t LATE1:1;
    uint32_t LATE2:1;
    uint32_t LATE3:1;
    uint32_t LATE4:1;
    uint32_t LATE5:1;
    uint32_t LATE6:1;
    uint32_t LATE7:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATEbits_t;
extern volatile __LATEbits_t LATEbits __asm__ ("LATE") __attribute__((section("sfrs"), address(0xBF886120)));
extern volatile uint32_t        LATECLR __attribute__((section("sfrs"),address(0xBF886124)));
extern volatile uint32_t        LATESET __attribute__((section("sfrs"),address(0xBF886128)));
extern volatile uint32_t        LATEINV __attribute__((section("sfrs"),address(0xBF88612C)));
#define ODCE ODCE
extern volatile uint32_t   ODCE __attribute__((section("sfrs"), address(0xBF886130)));
typedef union {
  struct {
    uint32_t ODCE0:1;
    uint32_t ODCE1:1;
    uint32_t ODCE2:1;
    uint32_t ODCE3:1;
    uint32_t ODCE4:1;
    uint32_t ODCE5:1;
    uint32_t ODCE6:1;
    uint32_t ODCE7:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCEbits_t;
extern volatile __ODCEbits_t ODCEbits __asm__ ("ODCE") __attribute__((section("sfrs"), address(0xBF886130)));
extern volatile uint32_t        ODCECLR __attribute__((section("sfrs"),address(0xBF886134)));
extern volatile uint32_t        ODCESET __attribute__((section("sfrs"),address(0xBF886138)));
extern volatile uint32_t        ODCEINV __attribute__((section("sfrs"),address(0xBF88613C)));
#define TRISF TRISF
extern volatile uint32_t   TRISF __attribute__((section("sfrs"), address(0xBF886140)));
typedef union {
  struct {
    uint32_t TRISF0:1;
    uint32_t TRISF1:1;
    uint32_t :1;
    uint32_t TRISF3:1;
    uint32_t TRISF4:1;
    uint32_t TRISF5:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISFbits_t;
extern volatile __TRISFbits_t TRISFbits __asm__ ("TRISF") __attribute__((section("sfrs"), address(0xBF886140)));
extern volatile uint32_t        TRISFCLR __attribute__((section("sfrs"),address(0xBF886144)));
extern volatile uint32_t        TRISFSET __attribute__((section("sfrs"),address(0xBF886148)));
extern volatile uint32_t        TRISFINV __attribute__((section("sfrs"),address(0xBF88614C)));
#define PORTF PORTF
extern volatile uint32_t   PORTF __attribute__((section("sfrs"), address(0xBF886150)));
typedef union {
  struct {
    uint32_t RF0:1;
    uint32_t RF1:1;
    uint32_t :1;
    uint32_t RF3:1;
    uint32_t RF4:1;
    uint32_t RF5:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTFbits_t;
extern volatile __PORTFbits_t PORTFbits __asm__ ("PORTF") __attribute__((section("sfrs"), address(0xBF886150)));
extern volatile uint32_t        PORTFCLR __attribute__((section("sfrs"),address(0xBF886154)));
extern volatile uint32_t        PORTFSET __attribute__((section("sfrs"),address(0xBF886158)));
extern volatile uint32_t        PORTFINV __attribute__((section("sfrs"),address(0xBF88615C)));
#define LATF LATF
extern volatile uint32_t   LATF __attribute__((section("sfrs"), address(0xBF886160)));
typedef union {
  struct {
    uint32_t LATF0:1;
    uint32_t LATF1:1;
    uint32_t :1;
    uint32_t LATF3:1;
    uint32_t LATF4:1;
    uint32_t LATF5:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATFbits_t;
extern volatile __LATFbits_t LATFbits __asm__ ("LATF") __attribute__((section("sfrs"), address(0xBF886160)));
extern volatile uint32_t        LATFCLR __attribute__((section("sfrs"),address(0xBF886164)));
extern volatile uint32_t        LATFSET __attribute__((section("sfrs"),address(0xBF886168)));
extern volatile uint32_t        LATFINV __attribute__((section("sfrs"),address(0xBF88616C)));
#define ODCF ODCF
extern volatile uint32_t   ODCF __attribute__((section("sfrs"), address(0xBF886170)));
typedef union {
  struct {
    uint32_t ODCF0:1;
    uint32_t ODCF1:1;
    uint32_t :1;
    uint32_t ODCF3:1;
    uint32_t ODCF4:1;
    uint32_t ODCF5:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCFbits_t;
extern volatile __ODCFbits_t ODCFbits __asm__ ("ODCF") __attribute__((section("sfrs"), address(0xBF886170)));
extern volatile uint32_t        ODCFCLR __attribute__((section("sfrs"),address(0xBF886174)));
extern volatile uint32_t        ODCFSET __attribute__((section("sfrs"),address(0xBF886178)));
extern volatile uint32_t        ODCFINV __attribute__((section("sfrs"),address(0xBF88617C)));
#define TRISG TRISG
extern volatile uint32_t   TRISG __attribute__((section("sfrs"), address(0xBF886180)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t TRISG2:1;
    uint32_t TRISG3:1;
    uint32_t :2;
    uint32_t TRISG6:1;
    uint32_t TRISG7:1;
    uint32_t TRISG8:1;
    uint32_t TRISG9:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISGbits_t;
extern volatile __TRISGbits_t TRISGbits __asm__ ("TRISG") __attribute__((section("sfrs"), address(0xBF886180)));
extern volatile uint32_t        TRISGCLR __attribute__((section("sfrs"),address(0xBF886184)));
extern volatile uint32_t        TRISGSET __attribute__((section("sfrs"),address(0xBF886188)));
extern volatile uint32_t        TRISGINV __attribute__((section("sfrs"),address(0xBF88618C)));
#define PORTG PORTG
extern volatile uint32_t   PORTG __attribute__((section("sfrs"), address(0xBF886190)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t RG2:1;
    uint32_t RG3:1;
    uint32_t :2;
    uint32_t RG6:1;
    uint32_t RG7:1;
    uint32_t RG8:1;
    uint32_t RG9:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTGbits_t;
extern volatile __PORTGbits_t PORTGbits __asm__ ("PORTG") __attribute__((section("sfrs"), address(0xBF886190)));
extern volatile uint32_t        PORTGCLR __attribute__((section("sfrs"),address(0xBF886194)));
extern volatile uint32_t        PORTGSET __attribute__((section("sfrs"),address(0xBF886198)));
extern volatile uint32_t        PORTGINV __attribute__((section("sfrs"),address(0xBF88619C)));
#define LATG LATG
extern volatile uint32_t   LATG __attribute__((section("sfrs"), address(0xBF8861A0)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t LATG2:1;
    uint32_t LATG3:1;
    uint32_t :2;
    uint32_t LATG6:1;
    uint32_t LATG7:1;
    uint32_t LATG8:1;
    uint32_t LATG9:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATGbits_t;
extern volatile __LATGbits_t LATGbits __asm__ ("LATG") __attribute__((section("sfrs"), address(0xBF8861A0)));
extern volatile uint32_t        LATGCLR __attribute__((section("sfrs"),address(0xBF8861A4)));
extern volatile uint32_t        LATGSET __attribute__((section("sfrs"),address(0xBF8861A8)));
extern volatile uint32_t        LATGINV __attribute__((section("sfrs"),address(0xBF8861AC)));
#define ODCG ODCG
extern volatile uint32_t   ODCG __attribute__((section("sfrs"), address(0xBF8861B0)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t ODCG2:1;
    uint32_t ODCG3:1;
    uint32_t :2;
    uint32_t ODCG6:1;
    uint32_t ODCG7:1;
    uint32_t ODCG8:1;
    uint32_t ODCG9:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCGbits_t;
