MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx664f128h.h
extern volatile __EMACxSUPPbits_t EMACxSUPPbits __asm__ ("EMACxSUPP") __attribute__((section("sfrs"), address(0xBF889260)));
extern volatile uint32_t        EMAC1SUPPCLR __attribute__((section("sfrs"),address(0xBF889264)));
extern volatile uint32_t        EMACxSUPPCLR __attribute__((section("sfrs"),address(0xBF889264)));
extern volatile uint32_t        EMAC1SUPPSET __attribute__((section("sfrs"),address(0xBF889268)));
extern volatile uint32_t        EMACxSUPPSET __attribute__((section("sfrs"),address(0xBF889268)));
extern volatile uint32_t        EMAC1SUPPINV __attribute__((section("sfrs"),address(0xBF88926C)));
extern volatile uint32_t        EMACxSUPPINV __attribute__((section("sfrs"),address(0xBF88926C)));
#define EMAC1TEST EMAC1TEST
extern volatile uint32_t   EMAC1TEST __attribute__((section("sfrs"), address(0xBF889270)));
typedef union {
  struct {
    uint32_t SHRTQNTA:1;
    uint32_t TESTPAUSE:1;
    uint32_t TESTBP:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1TESTbits_t;
extern volatile __EMAC1TESTbits_t EMAC1TESTbits __asm__ ("EMAC1TEST") __attribute__((section("sfrs"), address(0xBF889270)));
#define EMACxTEST EMACxTEST
extern volatile uint32_t   EMACxTEST __attribute__((section("sfrs"), address(0xBF889270)));
typedef union {
  struct {
    uint32_t SHRTQNTA:1;
    uint32_t TESTPAUSE:1;
    uint32_t TESTBP:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxTESTbits_t;
extern volatile __EMACxTESTbits_t EMACxTESTbits __asm__ ("EMACxTEST") __attribute__((section("sfrs"), address(0xBF889270)));
extern volatile uint32_t        EMAC1TESTCLR __attribute__((section("sfrs"),address(0xBF889274)));
extern volatile uint32_t        EMACxTESTCLR __attribute__((section("sfrs"),address(0xBF889274)));
extern volatile uint32_t        EMAC1TESTSET __attribute__((section("sfrs"),address(0xBF889278)));
extern volatile uint32_t        EMACxTESTSET __attribute__((section("sfrs"),address(0xBF889278)));
extern volatile uint32_t        EMAC1TESTINV __attribute__((section("sfrs"),address(0xBF88927C)));
extern volatile uint32_t        EMACxTESTINV __attribute__((section("sfrs"),address(0xBF88927C)));
#define EMAC1MCFG EMAC1MCFG
extern volatile uint32_t   EMAC1MCFG __attribute__((section("sfrs"), address(0xBF889280)));
typedef union {
  struct {
    uint32_t SCANINC:1;
    uint32_t NOPRE:1;
    uint32_t CLKSEL:4;
    uint32_t :9;
    uint32_t RESETMGMT:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1MCFGbits_t;
extern volatile __EMAC1MCFGbits_t EMAC1MCFGbits __asm__ ("EMAC1MCFG") __attribute__((section("sfrs"), address(0xBF889280)));
#define EMACxMCFG EMACxMCFG
extern volatile uint32_t   EMACxMCFG __attribute__((section("sfrs"), address(0xBF889280)));
typedef union {
  struct {
    uint32_t SCANINC:1;
    uint32_t NOPRE:1;
    uint32_t CLKSEL:4;
    uint32_t :9;
    uint32_t RESETMGMT:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxMCFGbits_t;
extern volatile __EMACxMCFGbits_t EMACxMCFGbits __asm__ ("EMACxMCFG") __attribute__((section("sfrs"), address(0xBF889280)));
extern volatile uint32_t        EMAC1MCFGCLR __attribute__((section("sfrs"),address(0xBF889284)));
extern volatile uint32_t        EMACxMCFGCLR __attribute__((section("sfrs"),address(0xBF889284)));
extern volatile uint32_t        EMAC1MCFGSET __attribute__((section("sfrs"),address(0xBF889288)));
extern volatile uint32_t        EMACxMCFGSET __attribute__((section("sfrs"),address(0xBF889288)));
extern volatile uint32_t        EMAC1MCFGINV __attribute__((section("sfrs"),address(0xBF88928C)));
extern volatile uint32_t        EMACxMCFGINV __attribute__((section("sfrs"),address(0xBF88928C)));
#define EMAC1MCMD EMAC1MCMD
extern volatile uint32_t   EMAC1MCMD __attribute__((section("sfrs"), address(0xBF889290)));
typedef union {
  struct {
    uint32_t READ:1;
    uint32_t SCAN:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1MCMDbits_t;
extern volatile __EMAC1MCMDbits_t EMAC1MCMDbits __asm__ ("EMAC1MCMD") __attribute__((section("sfrs"), address(0xBF889290)));
#define EMACxMCMD EMACxMCMD
extern volatile uint32_t   EMACxMCMD __attribute__((section("sfrs"), address(0xBF889290)));
typedef union {
  struct {
    uint32_t READ:1;
    uint32_t SCAN:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxMCMDbits_t;
extern volatile __EMACxMCMDbits_t EMACxMCMDbits __asm__ ("EMACxMCMD") __attribute__((section("sfrs"), address(0xBF889290)));
extern volatile uint32_t        EMAC1MCMDCLR __attribute__((section("sfrs"),address(0xBF889294)));
extern volatile uint32_t        EMACxMCMDCLR __attribute__((section("sfrs"),address(0xBF889294)));
extern volatile uint32_t        EMAC1MCMDSET __attribute__((section("sfrs"),address(0xBF889298)));
extern volatile uint32_t        EMACxMCMDSET __attribute__((section("sfrs"),address(0xBF889298)));
extern volatile uint32_t        EMAC1MCMDINV __attribute__((section("sfrs"),address(0xBF88929C)));
extern volatile uint32_t        EMACxMCMDINV __attribute__((section("sfrs"),address(0xBF88929C)));
#define EMAC1MADR EMAC1MADR
extern volatile uint32_t   EMAC1MADR __attribute__((section("sfrs"), address(0xBF8892A0)));
typedef union {
  struct {
    uint32_t REGADDR:5;
    uint32_t :3;
    uint32_t PHYADDR:5;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1MADRbits_t;
extern volatile __EMAC1MADRbits_t EMAC1MADRbits __asm__ ("EMAC1MADR") __attribute__((section("sfrs"), address(0xBF8892A0)));
#define EMACxMADR EMACxMADR
extern volatile uint32_t   EMACxMADR __attribute__((section("sfrs"), address(0xBF8892A0)));
typedef union {
  struct {
    uint32_t REGADDR:5;
    uint32_t :3;
    uint32_t PHYADDR:5;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxMADRbits_t;
extern volatile __EMACxMADRbits_t EMACxMADRbits __asm__ ("EMACxMADR") __attribute__((section("sfrs"), address(0xBF8892A0)));
extern volatile uint32_t        EMAC1MADRCLR __attribute__((section("sfrs"),address(0xBF8892A4)));
extern volatile uint32_t        EMACxMADRCLR __attribute__((section("sfrs"),address(0xBF8892A4)));
extern volatile uint32_t        EMAC1MADRSET __attribute__((section("sfrs"),address(0xBF8892A8)));
extern volatile uint32_t        EMACxMADRSET __attribute__((section("sfrs"),address(0xBF8892A8)));
extern volatile uint32_t        EMAC1MADRINV __attribute__((section("sfrs"),address(0xBF8892AC)));
extern volatile uint32_t        EMACxMADRINV __attribute__((section("sfrs"),address(0xBF8892AC)));
#define EMAC1MWTD EMAC1MWTD
extern volatile uint32_t   EMAC1MWTD __attribute__((section("sfrs"), address(0xBF8892B0)));
typedef union {
  struct {
    uint32_t MWTD:16;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1MWTDbits_t;
